functional/ws/templates/PnPInvoiceExample.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="http://pnpportal.co.za/InvoiceEanUcc">
   <soapenv:Header>
      <inv:Security>
         <inv:UsernameToken>
            <inv:Username>invpass</inv:Username>
            <inv:Password>test</inv:Password>
         </inv:UsernameToken>
      </inv:Security>
   </soapenv:Header>
   <soapenv:Body>
      <sh:StandardBusinessDocument xsi:schemaLocation="urn:ean.ucc:2 ../Schemas/InvoiceProxy.xsd http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader ../Schemas/sbdh/StandardBusinessDocumentHeader.xsd" xmlns:sh="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader" xmlns:eanucc="urn:ean.ucc:2" xmlns:pay="urn:ean.ucc:pay:2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <sh:StandardBusinessDocumentHeader>
            <sh:HeaderVersion>1.0</sh:HeaderVersion>
            <sh:Sender>
               <sh:Identifier Authority="EAN.UCC">6001098765432</sh:Identifier>
            </sh:Sender>
            <sh:Receiver>
               <sh:Identifier Authority="EAN.UCC">6001007000004</sh:Identifier>
            </sh:Receiver>
            <sh:DocumentIdentification>
               <sh:Standard>EAN.UCC</sh:Standard>
               <sh:TypeVersion>2.5</sh:TypeVersion>
               <sh:InstanceIdentifier>100002</sh:InstanceIdentifier>
               <sh:Type>Invoice</sh:Type>
               <sh:MultipleType>false</sh:MultipleType>
               <sh:CreationDateAndTime>2009-08-12T11:00:00.000</sh:CreationDateAndTime>
            </sh:DocumentIdentification>
         </sh:StandardBusinessDocumentHeader>
         <eanucc:message>
            <entityIdentification>
               <uniqueCreatorIdentification>MSG-123-20040110</uniqueCreatorIdentification>
               <contentOwner>
                  <gln>6001098765432</gln>
               </contentOwner>
            </entityIdentification>
            <eanucc:transaction>
               <entityIdentification>
                  <uniqueCreatorIdentification>TRA-041-66573058</uniqueCreatorIdentification>
                  <contentOwner>
                     <gln>6001098765432</gln>
                  </contentOwner>
               </entityIdentification>
               <command>
                  <eanucc:documentCommand>
                     <documentCommandHeader type="ADD">
                        <entityIdentification>
                           <uniqueCreatorIdentification>CMD-912-54618595</uniqueCreatorIdentification>
                           <contentOwner>
                              <gln>6001098765432</gln>
                           </contentOwner>
                        </entityIdentification>
                     </documentCommandHeader>
                     <documentCommandOperand>
                        <pay:invoice creationDateTime="2009-08-12T11:00:00.000" documentStatus="COPY">
                           <contentVersion>
                              <versionIdentification>2.5</versionIdentification>
                           </contentVersion>
                           <documentStructureVersion>
                              <versionIdentification>2.5</versionIdentification>
                           </documentStructureVersion>
                           <invoiceIdentification>
                              <uniqueCreatorIdentification>300078521</uniqueCreatorIdentification>
                              <contentOwner>
                                 <gln>6001098765432</gln>
                              </contentOwner>
                           </invoiceIdentification>
                           <invoiceCurrency>
                              <currencyISOCode>ZAR</currencyISOCode>
                           </invoiceCurrency>
                           <invoiceType>INVOICE</invoiceType>
                           <countryOfSupplyOfGoods>
                              <countryISOCode>ZA</countryISOCode>
                           </countryOfSupplyOfGoods>
                           <shipTo>
                              <gln>6001007031091</gln>
                           </shipTo>
                           <buyer>
                              <partyIdentification>
                                 <gln>6001007000004</gln>
                              </partyIdentification>
                           </buyer>
                           <seller>
                              <partyIdentification>
                                 <gln>6001098765432</gln>
                              </partyIdentification>
                              <extension>
                                 <vat:vATInvoicePartyExtension xsi:schemaLocation="urn:ean.ucc:pay:vat:2 ../Schemas/Invoice_VATExtensionProxy.xsd" xmlns:vat="urn:ean.ucc:pay:vat:2">
                                    <vATRegistrationNumber>1234567890</vATRegistrationNumber>
                                 </vat:vATInvoicePartyExtension>
                              </extension>
                           </seller>
                           <invoiceLineItem number="1">
                              <tradeItemIdentification>
                                 <gtin>6000000001234</gtin>
                                 <additionalTradeItemIdentification>
                                    <additionalTradeItemIdentificationValue>1234</additionalTradeItemIdentificationValue>
                                    <additionalTradeItemIdentificationType>SUPPLIER_ASSIGNED</additionalTradeItemIdentificationType>
                                 </additionalTradeItemIdentification>
                              </tradeItemIdentification>
                              <invoicedQuantity>
                                 <value>10</value>
                                 <unitOfMeasure>
                                    <measurementUnitCodeValue>CS</measurementUnitCodeValue>
                                 </unitOfMeasure>
                              </invoicedQuantity>
                              <transferOfOwnershipDate>2009-08-12</transferOfOwnershipDate>
                              <amountInclusiveAllowancesCharges>1214.6</amountInclusiveAllowancesCharges>
                              <itemDescription>
                                 <text>Red Widgets</text>
                              </itemDescription>
                              <itemPriceInclusiveAllowancesCharges>121.46</itemPriceInclusiveAllowancesCharges>
                              <invoiceLineItemAfterTaxes>
                                 <amountInclusiveAllowancesCharges>1384.64</amountInclusiveAllowancesCharges>
                              </invoiceLineItemAfterTaxes>
                              <invoiceLineTaxInformation>
                                 <dutyTaxFeeType>VALUE_ADDED_TAX</dutyTaxFeeType>
                                 <taxableAmount>1214.6</taxableAmount>
                                 <taxAmount>170.04</taxAmount>
                                 <extension>
                                    <vat:vATTaxInformationExtension xsi:schemaLocation="urn:ean.ucc:pay:vat:2 ../Schemas/Invoice_VATExtensionProxy.xsd" xmlns:vat="urn:ean.ucc:pay:vat:2">
                                       <rate>14</rate>
                                       <vATCategory>STANDARD_RATE</vATCategory>
                                    </vat:vATTaxInformationExtension>
                                 </extension>
                              </invoiceLineTaxInformation>
                              <extension>
                                 <invoicedWeight>
                                    <value/>
                                    <unitOfMeasure>
                                       <measurementUnitCodeValue/>
                                    </unitOfMeasure>
                                 </invoicedWeight>
                              </extension>
                           </invoiceLineItem>
                           <invoiceLineItem number="2">
                              <tradeItemIdentification>
                                 <gtin>6000000002345</gtin>
                                 <additionalTradeItemIdentification>
                                    <additionalTradeItemIdentificationValue>2345</additionalTradeItemIdentificationValue>
                                    <additionalTradeItemIdentificationType>SUPPLIER_ASSIGNED</additionalTradeItemIdentificationType>
                                 </additionalTradeItemIdentification>
                              </tradeItemIdentification>
                              <invoicedQuantity>
                                 <value>20</value>
                                 <unitOfMeasure>
                                    <measurementUnitCodeValue>CS</measurementUnitCodeValue>
                                 </unitOfMeasure>
                              </invoicedQuantity>
                              <transferOfOwnershipDate>2009-08-12</transferOfOwnershipDate>
                              <amountInclusiveAllowancesCharges>894.8</amountInclusiveAllowancesCharges>
                              <itemDescription>
                                 <text>Blue Widgets</text>
                              </itemDescription>
                              <itemPriceInclusiveAllowancesCharges>44.74</itemPriceInclusiveAllowancesCharges>
                              <invoiceLineItemAfterTaxes>
                                 <amountInclusiveAllowancesCharges>894.8</amountInclusiveAllowancesCharges>
                              </invoiceLineItemAfterTaxes>
                              <invoiceLineTaxInformation>
                                 <dutyTaxFeeType>VALUE_ADDED_TAX</dutyTaxFeeType>
                                 <taxableAmount>894.8</taxableAmount>
                                 <taxAmount>0</taxAmount>
                                 <extension>
                                    <vat:vATTaxInformationExtension xsi:schemaLocation="urn:ean.ucc:pay:vat:2 ../Schemas/Invoice_VATExtensionProxy.xsd" xmlns:vat="urn:ean.ucc:pay:vat:2">
                                       <rate>0</rate>
                                       <vATCategory>ZERO_RATE</vATCategory>
                                    </vat:vATTaxInformationExtension>
                                 </extension>
                              </invoiceLineTaxInformation>
                              <extension>
                                 <invoicedWeight>
                                    <value/>
                                    <unitOfMeasure>
                                       <measurementUnitCodeValue/>
                                    </unitOfMeasure>
                                 </invoicedWeight>
                              </extension>
                           </invoiceLineItem>
                           <invoiceLineItem number="3">
                              <tradeItemIdentification>
                                 <gtin>6000000003456</gtin>
                                 <additionalTradeItemIdentification>
                                    <additionalTradeItemIdentificationValue>3456</additionalTradeItemIdentificationValue>
                                    <additionalTradeItemIdentificationType>SUPPLIER_ASSIGNED</additionalTradeItemIdentificationType>
                                 </additionalTradeItemIdentification>
                              </tradeItemIdentification>
                              <invoicedQuantity>
                                 <value>15</value>
                                 <unitOfMeasure>
                                    <measurementUnitCodeValue>CS</measurementUnitCodeValue>
                                 </unitOfMeasure>
                              </invoicedQuantity>
                              <transferOfOwnershipDate>2009-08-12</transferOfOwnershipDate>
                              <amountInclusiveAllowancesCharges>1973.7</amountInclusiveAllowancesCharges>
                              <itemDescription>
                                 <text>Green Widgets</text>
                              </itemDescription>
                              <itemPriceInclusiveAllowancesCharges>131.58</itemPriceInclusiveAllowancesCharges>
                              <invoiceLineItemAfterTaxes>
                                 <amountInclusiveAllowancesCharges>1973.7</amountInclusiveAllowancesCharges>
                              </invoiceLineItemAfterTaxes>
                              <invoiceLineTaxInformation>
                                 <dutyTaxFeeType>VALUE_ADDED_TAX</dutyTaxFeeType>
                                 <taxableAmount>1973.7</taxableAmount>
                                 <taxAmount>0</taxAmount>
                                 <extension>
                                    <vat:vATTaxInformationExtension xsi:schemaLocation="urn:ean.ucc:pay:vat:2 ../Schemas/Invoice_VATExtensionProxy.xsd" xmlns:vat="urn:ean.ucc:pay:vat:2">
                                       <rate>0</rate>
                                       <vATCategory>EXEMPT</vATCategory>
                                    </vat:vATTaxInformationExtension>
                                 </extension>
                              </invoiceLineTaxInformation>
                              <extension>
                                 <invoicedWeight>
                                    <value/>
                                    <unitOfMeasure>
                                       <measurementUnitCodeValue/>
                                    </unitOfMeasure>
                                 </invoicedWeight>
                              </extension>
                           </invoiceLineItem>
                           <invoiceTotals>
                              <totalInvoiceAmount>4253.14</totalInvoiceAmount>
                              <totalLineAmountInclusiveAllowancesCharges>4083.1</totalLineAmountInclusiveAllowancesCharges>
                              <totalTaxAmount>170.04</totalTaxAmount>
                           </invoiceTotals>
                           <orderIdentification>
                              <uniqueCreatorIdentification>400123456</uniqueCreatorIdentification>
                              <contentOwner>
                                 <gln>6001007000004</gln>
                              </contentOwner>
                           </orderIdentification>
                        </pay:invoice>
                     </documentCommandOperand>
                  </eanucc:documentCommand>
               </command>
            </eanucc:transaction>
         </eanucc:message>
      </sh:StandardBusinessDocument>
   </soapenv:Body>
</soapenv:Envelope>